[
  {
    "id": "1",
    "title": "التحاليل والفحوصات الدورية",
    "category": "Medical Tests",
    "images": [
      "https://i.ibb.co/PvkLFMR2/Screenshot-2025-11-19-215320.png",
      "https://i.ibb.co/1JqJcH7L/Screenshot-2025-11-19-214951.png"
    ],
    "content": [
      {
        "type": "title",
        "value": "1. السكر التراكمي (HbA1c)"
      },
      {
        "type": "paragraph",
        "value": "الوصف: هو فحص دم يقيس متوسط مستوى سكر الدم (الجلوكوز) خلال الشهرين إلى الثلاثة أشهر الماضية. يرتبط سكر الدم ببروتين الهيموغلوبين الموجود في خلايا الدم الحمراء، وكلما ارتفع مستوى السكر في الدم، زادت كمية الهيموغلوبين الجلوكوزي."
      },
      {
        "type": "paragraph",
        "value": "استخدامات التحليل:\n- تشخيص مرض السكري أو مرحلة ما قبل السكري.\n- متابعة مدى نجاح خطة علاج مرض السكري."
      },
      {
        "type": "image_paragraph",
        "image": "https://i.ibb.co/1fqnhDwn/Screenshot-2025-11-19-214900.png",
        "paragraph": "تكرار الفحص:\n- عادة ما يوصي الطبيب بإجرائه مرتين إلى أربع مرات سنوياً، أو حسب الحالة.\n- إذا كان مستوى السكر تحت السيطرة ومستقراً، قد يُجرى كل ستة أشهر.\n- إذا كانت هناك تغييرات في خطة العلاج أو كان مستوى السكر غير مستقر، قد يُجرى كل ثلاثة أشهر."
      },
      {
        "type": "title",
        "value": "2. سكر الدم الصائم (Fasting Blood Glucose)"
      },
      {
        "type": "paragraph",
        "value": "الوصف: قياس مستوى السكر في الدم بعد صيام لا يقل عن 8 ساعات (عادة طوال الليل).\n\nاستخدامات التحليل:\n- تشخيص مرض السكري أو مرحلة ما قبل السكري.\n- متابعة مدى استجابة الجسم للعلاج (الأنسولين أو الأدوية الفموية)."
      },
      {
        "type": "paragraph",
        "value": "تكرار الفحص:\n- للتشخيص: يُجرى لمرة واحدة أو مرتين للتأكيد.\n- للمتابعة: حسب توجيهات الطبيب، قد يكون يومياً أو عدة مرات أسبوعياً باستخدام جهاز قياس السكر المنزلي، أو فحصاً مخبرياً بشكل دوري."
      },
      {
        "type": "title",
        "value": "3. فحص البول والمجهر لاختبار الزلال"
      },
      {
        "type": "image_paragraph",
        "image": "https://i.ibb.co/67MWnb7Y/Screenshot-2025-11-19-214937.png",
        "paragraph": "الوصف: فحص للكشف عن وجود كميات دقيقة من بروتين الألبومين في البول (البيلة الألبومينية الدقيقة). في الحالة الطبيعية، لا تعمل الكلى على تصفية الألبومين من الدم؛ لذا فإن وجود كمية كبيرة منه في البول قد يشير إلى بداية تأثر الكلى (اعتلال الكلية السكري)."
      },
      {
        "type": "paragraph",
        "value": "التحاليل ذات الصلة بوظائف الكلى:\n- اختبار نسبة الألبومين إلى الكرياتينين في البول (UACR): يقيس مقدار الألبومين مقارنة بالكرياتينين في عينة البول، ما يوضح كفاءة عمل الكلى."
      },
      {
        "type": "image_paragraph",
        "image": "https://i.ibb.co/chhN6T1Q/Screenshot-2025-11-19-214918.png",
        "paragraph": "- الكرياتينين في الدم ومعدل الترشيح الكبيبي المقدر (eGFR): الكرياتينين هو أحد فضلات التمثيل الغذائي، وقياس مستواه في الدم يستخدم لحساب معدل الترشيح الكبيبي، والذي يُعد مؤشراً على مدى سرعة الكلى في تصفية الفضلات من الدم (السرعة المنخفضة تعني أن الكلى لا تعمل بكفاءة)."
      },
      {
        "type": "paragraph",
        "value": "تكرار الفحص: يوصى بإجراء فحص الألبومين في البول وحساب معدل الترشيح الكبيبي (eGFR) مرة واحدة سنوياً على الأقل لجميع مرضى السكري."
      }
    ]
  },
  {
    "id": "2",
    "title": "أنواع مرض السكري والفروقات بينها",
    "category": "Education",
    "images": [
      "https://i.ibb.co/5gJMf0Q7/Screenshot-2025-11-19-215235.png",
      "https://i.ibb.co/MkMKg16c/Screenshot-2025-11-19-215049.png"
    ],
    "content": [
      {
        "type": "title",
        "value": "1. السكري من النوع الأول (Type 1 Diabetes)"
      },
      {
        "type": "paragraph",
        "value": "الوصف: مرض مناعي ذاتي، يحدث عندما يهاجم جهاز المناعة في الجسم ويدمر الخلايا المنتجة للأنسولين في البنكرياس. نتيجة لذلك، يتوقف البنكرياس عن إنتاج الأنسولين أو ينتج كميات قليلة جداً.\n\nالفئة المستهدفة والعلاج: غالباً ما يتم تشخيصه لدى الأطفال والشباب، ويتطلب العلاج بالإنسولين الخارجي (الحقن) مدى الحياة."
      },
      {
        "type": "title",
        "value": "2. السكري من النوع الثاني (Type 2 Diabetes)"
      },
      {
        "type": "image_paragraph",
        "image": "https://i.ibb.co/MkMKg16c/Screenshot-2025-11-19-215049.png",
        "paragraph": "الوصف: هو النوع الأكثر شيوعاً، ويحدث نتيجة لمشكلتين رئيسيتين:\n- مقاومة الأنسولين: عدم استجابة خلايا الجسم (مثل العضلات والدهون والكبد) للأنسولين بشكل صحيح، فلا تستطيع امتصاص سكر الدم بشكل كافٍ.\n- نقص إنتاج الأنسولين: عدم قدرة البنكرياس على إنتاج كمية كافية من الأنسولين بمرور الوقت لمواجهة المقاومة."
      },
      {
        "type": "image_paragraph",
        "image": "https://i.ibb.co/hFJcT1Bz/Screenshot-2025-11-19-215253.png",
        "paragraph": "العوامل والعلاج: يرتبط بعوامل مثل السمنة، وقلة النشاط البدني، والوراثة. غالباً ما يتم تشخيصه لدى البالغين، وقد يُعالج بتغيير نمط الحياة والأدوية الفموية، وقد يحتاج إلى حقن الأنسولين لاحقاً."
      },
      {
        "type": "title",
        "value": "3. سكري الحمل (Gestational Diabetes)"
      },
      {
        "type": "paragraph",
        "value": "الوصف: يحدث لأول مرة أثناء الحمل (ارتفاع مستويات الجلوكوز في الدم لدى الأم).\n\nالمآل والمخاطر: بعد الولادة، يختفي السكري عادة، لكن النساء اللاتي أصبن به يزداد لديهن خطر الإصابة بالسكري من النوع الثاني في المستقبل. قد يتسبب في حصول الطفل على جلوكوز إضافي وزيادة في وزن الطفل."
      },
      {
        "type": "paragraph",
        "value": "المتابعة: يتطلب متابعة دقيقة وعلاجاً خلال فترة الحمل لضمان صحة الأم والجنين."
      }
    ]
  },
  {
    "id": "3",
    "title": "أجهزة قياس السكر والفروقات بينها",
    "category": "Devices",
    "images": [
      "https://i.ibb.co/k2GFbntv/Screenshot-2025-11-19-214849.png",
      "https://i.ibb.co/7qBknkv/Screenshot-2025-11-19-215111.png"
    ],
    "content": [
      {
        "type": "title",
        "value": "1. جهاز قياس سكر الدم التقليدي"
      },
      {
        "type": "paragraph",
        "value": "المكونات: يتكون الجهاز من أربع قطع أساسية: جهاز القياس، وشرائط الاختبار، وقلم الوخز، وإبر الوخز (المشارط)."
      },
      {
        "type": "image_paragraph",
        "image": "https://i.ibb.co/k2GFbntv/Screenshot-2025-11-19-214849.png",
        "paragraph": "آلية العمل: يتم وخز طرف الإصبع بقلم الوخز، ثم وضع قطرة الدم الناتجة على شريط الاختبار المدخل في الجهاز لتظهر القراءة على الشاشة في بضع ثوانٍ.\n\nأنواع شائعة: تتوفر أنواع مختلفة مثل Accu-Chek (بأنواعه Instant, Guide, Active) و One Touch (مثل Select Plus) و Contour (مثل TS, Plus One)."
      },
      {
        "type": "title",
        "value": "2. أجهزة القياس المستمر لسكر الدم (CGM)"
      },
      {
        "type": "paragraph",
        "value": "الوصف: تعمل بدون الحاجة إلى وخز الإصبع المتكرر.\n\nآلية العمل: يتم تثبيت مستشعر صغير (صغير الحجم ومقاوم للماء) تحت الجلد، وعادةً ما يكون في الجزء الخلفي من الذراع. يقيس هذا المستشعر مستوى الجلوكوز في السائل الخلالي بشكل مستمر."
      },
      {
        "type": "image_paragraph",
        "image": "https://i.ibb.co/7qBknkv/Screenshot-2025-11-19-215111.png",
        "paragraph": "قراءة النتائج: يمكن قراءة النتيجة بمسح ضوئي للجهاز (القراءات المتقطعة) أو عبر بث القراءات إلى جهاز استقبال أو هاتف ذكي (القياس المستمر). تتميز هذه الأجهزة بإعطاء اتجاهات لمستوى السكر (صعوداً أو هبوطاً) مما يساعد على اتخاذ الإجراءات الاستباقية.\n\nمثال: جهاز فري ستايل ليبري (FreeStyle Libre) هو مثال على أجهزة القياس المتقطع."
      }
    ]
  },
  {
    "id": "4",
    "title": "الفرق بين سرنجات وأقلام الأنسولين",
    "category": "Medication",
    "images": [
      "https://i.ibb.co/kgZZYrCd/Screenshot-2025-11-19-215019.png",
      "https://i.ibb.co/bMdMdPJ7/Screenshot-2025-11-19-215005.png"
    ],
    "content": [
      {
        "type": "title",
        "value": "1. سرنجات الأنسولين (Insulin Syringes)"
      },
      {
        "type": "paragraph",
        "value": "الوصف: أدوات حقن تستخدم لحقن الأنسولين تحت الجلد."
      },
      {
        "type": "paragraph",
        "value": "الفروقات الرئيسية:\n\nالسعة (الحجم): تُستخدم لتحديد حجم الجرعة الإجمالية.\n- 0.3 مل للجرعات الصغيرة (عادة أقل من 30 وحدة).\n- 0.5 مل للجرعات المتوسطة (عادة أقل من 50 وحدة).\n- 1 مل للجرعات الكبيرة (عادة أقل من 100 وحدة)."
      },
      {
        "type": "paragraph",
        "value": "طول الإبرة: تتوفر بأطوال مختلفة (مثل 4 مم، 5 مم، 6 مم، 8 مم، 12.7 مم). تُفضل الإبر الأقصر (مثل 4 مم أو 5 مم) لمعظم البالغين والأطفال لتقليل خطر حقن الأنسولين في العضل بدلاً من الدهون تحت الجلد."
      },
      {
        "type": "paragraph",
        "value": "قطر الإبرة (Gauge): يشير إلى سماكة الإبرة (كلما زاد الرقم، كانت الإبرة أرق). تتوفر بدرجات مثل (29G, 30G, 31G)، والإبر الأرق عادةً ما تكون أكثر راحة وأقل ألماً عند الحقن."
      },
      {
        "type": "title",
        "value": "2. قلم الأنسولين (Insulin Pen)"
      },
      {
        "type": "image_paragraph",
        "image": "https://i.ibb.co/kgZZYrCd/Screenshot-2025-11-19-215019.png",
        "paragraph": "الوصف: جهاز لحقن الأنسولين يشبه القلم. يتكون من جهاز القلم، وخرطوشة (عبوة) الأنسولين القابلة للتبديل (أو غير القابلة للتبديل في بعض الأنواع)، وسن/إبرة القلم القابلة للتغيير.\n\nآلية العمل: يتم تحديد الجرعة المطلوبة عن طريق قرص أو مقياس، ثم يتم الحقن."
      },
      {
        "type": "paragraph",
        "value": "المميزات والفروقات:\n- سهولة الاستخدام والدقة: يوفر جرعات دقيقة وسهل الحمل والاستخدام في الأماكن العامة.\n- نوع الإبرة: يستخدم إبراً قصيرة ورفيعة (عادة 4 مم إلى 8 مم) مصممة خصيصاً للأقلام.\n- قابلية إعادة الاستخدام: بعض الأقلام تكون قابلة لإعادة الاستخدام (تغيير الخرطوشة فقط)، والبعض الآخر معبأ مسبقاً ويتم التخلص منه بعد نفاذ الأنسولين (أقلام للاستخدام لمرة واحدة)."
      }
    ]
  }
]
