{
  "title": "دليل التحاليل الشامل وأنواع السكري وأجهزة القياس",
  "images": [
    "https://i.ibb.co/1fqnhDwn/Screenshot-2025-11-19-214900.png"
  ],
  "content": [
    {
      "type": "image_paragraph",
      "image": "https://i.ibb.co/5gJMf0Q7/Screenshot-2025-11-19-215235.png",
      "paragraph": "تعتبر المتابعة الدورية والفهم العميق لطبيعة مرض السكري حجر الزاوية في الحفاظ على صحة المريض وتجنب المضاعفات. في هذا الدليل، نستعرض أهم التحاليل، الفروقات بين أنواع السكري، وأدوات القياس والعلاج."
    },
    {
      "type": "title",
      "value": "أولاً: التحاليل والفحوصات الدورية"
    },
    {
      "type": "title",
      "value": "1. السكر التراكمي (HbA1c)"
    },
    {
      "type": "image_paragraph",
      "image": "https://i.ibb.co/PvkLFMR2/Screenshot-2025-11-19-215320.png",
      "paragraph": "الوصف: هو فحص دم يقيس متوسط مستوى سكر الدم (الجلوكوز) خلال الشهرين إلى الثلاثة أشهر الماضية. يرتبط سكر الدم ببروتين الهيموغلوبين الموجود في خلايا الدم الحمراء، وكلما ارتفع مستوى السكر في الدم، زادت كمية الهيموغلوبين الجلوكوزي."
    },
    {
      "type": "paragraph",
      "value": "استخدامات التحليل:\n- تشخيص مرض السكري أو مرحلة ما قبل السكري.\n- متابعة مدى نجاح خطة علاج مرض السكري."
    },
    {
      "type": "paragraph",
      "value": "تكرار الفحص:\n- عادة ما يوصي الطبيب بإجرائه مرتين إلى أربع مرات سنوياً، أو حسب الحالة.\n- إذا كان مستوى السكر تحت السيطرة ومستقراً، قد يُجرى كل ستة أشهر.\n- إذا كانت هناك تغييرات في خطة العلاج أو كان مستوى السكر غير مستقر، قد يُجرى كل ثلاثة أشهر."
    },
    {
      "type": "title",
      "value": "2. سكر الدم الصائم (Fasting Blood Glucose)"
    },
    {
      "type": "image_paragraph",
      "image": "https://i.ibb.co/7qBknkv/Screenshot-2025-11-19-215111.png",
      "paragraph": "الوصف: قياس مستوى السكر في الدم بعد صيام لا يقل عن 8 ساعات (عادة طوال الليل)."
    },
    {
      "type": "paragraph",
      "value": "استخدامات التحليل:\n- تشخيص مرض السكري أو مرحلة ما قبل السكري.\n- متابعة مدى استجابة الجسم للعلاج (الأنسولين أو الأدوية الفموية)."
    },
    {
      "type": "paragraph",
      "value": "تكرار الفحص:\n- للتشخيص: يُجرى لمرة واحدة أو مرتين للتأكيد.\n- للمتابعة: حسب توجيهات الطبيب، قد يكون يومياً أو عدة مرات أسبوعياً باستخدام جهاز قياس السكر المنزلي، أو فحصاً مخبرياً بشكل دوري."
    },
    {
      "type": "title",
      "value": "3. فحص البول والمجهر لاختبار الزلال (Microalbuminuria)"
    },
    {
      "type": "image",
      "value": "https://i.ibb.co/67MWnb7Y/Screenshot-2025-11-19-214937.png"
    },
    {
      "type": "paragraph",
      "value": "الوصف: فحص للكشف عن وجود كميات دقيقة من بروتين الألبومين في البول (البيلة الألبومينية الدقيقة). في الحالة الطبيعية، لا تعمل الكلى على تصفية الألبومين من الدم؛ لذا فإن وجود كمية كبيرة منه في البول قد يشير إلى بداية تأثر الكلى (اعتلال الكلية السكري)."
    },
    {
      "type": "image_paragraph",
      "image": "https://i.ibb.co/chhN6T1Q/Screenshot-2025-11-19-214918.png",
      "paragraph": "التحاليل ذات الصلة بوظائف الكلى:\n- اختبار نسبة الألبومين إلى الكرياتينين في البول (UACR): يقيس مقدار الألبومين مقارنة بالكرياتينين في عينة البول، ما يوضح كفاءة عمل الكلى.\n- الكرياتينين في الدم ومعدل الترشيح الكبيبي المقدر (eGFR): الكرياتينين هو أحد فضلات التمثيل الغذائي، وقياس مستواه في الدم يستخدم لحساب معدل الترشيح الكبيبي، والذي يُعد مؤشراً على مدى سرعة الكلى في تصفية الفضلات من الدم."
    },
    {
      "type": "paragraph",
      "value": "تكرار الفحص: يوصى بإجراء فحص الألبومين في البول وحساب معدل الترشيح الكبيبي (eGFR) مرة واحدة سنوياً على الأقل لجميع مرضى السكري."
    },
    {
      "type": "title",
      "value": "ثانياً: أنواع مرض السكري والفروقات بينها"
    },
    {
      "type": "paragraph",
      "value": "1. السكري من النوع الأول (Type 1 Diabetes)\nالوصف: مرض مناعي ذاتي، يحدث عندما يهاجم جهاز المناعة في الجسم ويدمر الخلايا المنتجة للأنسولين في البنكرياس. نتيجة لذلك، يتوقف البنكرياس عن إنتاج الأنسولين أو ينتج كميات قليلة جداً.\nالفئة المستهدفة والعلاج: غالباً ما يتم تشخيصه لدى الأطفال والشباب، ويتطلب العلاج بالإنسولين الخارجي (الحقن) مدى الحياة."
    },
    {
      "type": "title",
      "value": "2. السكري من النوع الثاني (Type 2 Diabetes)"
    },
    {
      "type": "image_paragraph",
      "image": "https://i.ibb.co/MkMKg16c/Screenshot-2025-11-19-215049.png",
      "paragraph": "الوصف: هو النوع الأكثر شيوعاً، ويحدث نتيجة لمشكلتين رئيسيتين:\n- مقاومة الأنسولين: عدم استجابة خلايا الجسم (مثل العضلات والدهون والكبد) للأنسولين بشكل صحيح.\n- نقص إنتاج الأنسولين: عدم قدرة البنكرياس على إنتاج كمية كافية من الأنسولين بمرور الوقت لمواجهة المقاومة."
    },
    {
      "type": "image_paragraph",
      "image": "https://i.ibb.co/1JqJcH7L/Screenshot-2025-11-19-214951.png",
      "paragraph": "العوامل والعلاج: يرتبط بعوامل مثل السمنة، وقلة النشاط البدني، والوراثة. غالباً ما يتم تشخيصه لدى البالغين، وقد يُعالج بتغيير نمط الحياة والأدوية الفموية، وقد يحتاج إلى حقن الأنسولين لاحقاً."
    },
    {
      "type": "paragraph",
      "value": "3. سكري الحمل (Gestational Diabetes)\nالوصف: يحدث لأول مرة أثناء الحمل (ارتفاع مستويات الجلوكوز في الدم لدى الأم).\nالمآل والمخاطر: بعد الولادة، يختفي السكري عادة، لكن النساء اللاتي أصبن به يزداد لديهن خطر الإصابة بالسكري من النوع الثاني في المستقبل.\nالمتابعة: يتطلب متابعة دقيقة وعلاجاً خلال فترة الحمل لضمان صحة الأم والجنين."
    },
    {
      "type": "title",
      "value": "ثالثاً: أجهزة قياس السكر والفروقات بينها"
    },
    {
      "type": "image_paragraph",
      "image": "https://i.ibb.co/k2GFbntv/Screenshot-2025-11-19-214849.png",
      "paragraph": "1. جهاز قياس سكر الدم التقليدي (Standard Blood Glucose Meter)\nالمكونات: يتكون الجهاز من أربع قطع أساسية: جهاز القياس، وشرائط الاختبار، وقلم الوخز، وإبر الوخز (المشارط)."
    },
    {
      "type": "paragraph",
      "value": "آلية العمل: يتم وخز طرف الإصبع بقلم الوخز، ثم وضع قطرة الدم الناتجة على شريط الاختبار المدخل في الجهاز لتظهر القراءة على الشاشة في بضع ثوانٍ.\nأنواع شائعة: تتوفر أنواع مختلفة مثل Accu-Chek و One Touch و Contour."
    },
    {
      "type": "paragraph",
      "value": "2. أجهزة القياس المستمر لسكر الدم (CGM)\nالوصف: تعمل بدون الحاجة إلى وخز الإصبع المتكرر.\nآلية العمل: يتم تثبيت مستشعر صغير تحت الجلد (عادةً في الذراع) يقيس الجلوكوز في السائل الخلالي بشكل مستمر.\nقراءة النتائج: يمكن قراءة النتيجة بمسح ضوئي للجهاز أو عبر بث القراءات إلى هاتف ذكي، وتوفر اتجاهات لمستوى السكر (صعوداً أو هبوطاً)."
    },
    {
      "type": "title",
      "value": "رابعاً: الفرق بين سرنجات وأقلام الأنسولين"
    },
    {
      "type": "paragraph",
      "value": "1. سرنجات الأنسولين (Insulin Syringes)\nالوصف: أدوات حقن تستخدم لحقن الأنسولين تحت الجلد.\nالفروقات الرئيسية:\n- السعة (الحجم): 0.3 مل، 0.5 مل، أو 1 مل حسب حجم الجرعة.\n- طول الإبرة: تتوفر بأطوال مختلفة، وتُفضل الإبر الأقصر (مثل 4 مم أو 5 مم) لتقليل خطر الحقن في العضل.\n- قطر الإبرة (Gauge): كلما زاد الرقم (مثل 31G)، كانت الإبرة أرق وأقل ألماً."
    },
    {
      "type": "paragraph",
      "value": "2. قلم الأنسولين (Insulin Pen)\nالوصف: جهاز لحقن الأنسولين يشبه القلم. يتكون من جهاز القلم، وخرطوشة الأنسولين، وسن/إبرة القلم.\nآلية العمل: يتم تحديد الجرعة المطلوبة عن طريق قرص، ثم يتم الحقن."
    },
    {
      "type": "image_paragraph",
      "image": "https://i.ibb.co/dnxVRFt/Screenshot-2025-11-19-215125.png",
      "paragraph": "المميزات والفروقات:\n- سهولة الاستخدام والدقة: يوفر جرعات دقيقة وسهل الحمل.\n- نوع الإبرة: يستخدم إبراً قصيرة ورفيعة (4-8 مم).\n- نمط الحياة: يساعد الالتزام بالعلاج وتغيير نمط الحياة وممارسة الرياضة في تحسين جودة الحياة والسيطرة على المرض."
    }
  ]
}
