{
  "title": "دليل شامل لمرض السكري: الفحوصات، الأنواع، الأجهزة والعادات اليومية",
  "images": [
    "https://i.ibb.co/5gJMf0Q7/Screenshot-2025-11-19-215235.png"
  ],
  "content": [
    {
      "type": "title",
      "value": "مقدمة"
    },
    {
      "type": "paragraph",
      "value": "هذا الدليل موجه لمرضى السكري وأسرهم ليوضح أهم التحاليل الدورية، وأنواع مرض السكري، وأجهزة قياس السكر، بالإضافة إلى عادات يومية بسيطة تساعد على التحكم الأفضل في مستوى السكر والوقاية من المضاعفات."
    },

    {
      "type": "title",
      "value": "أولاً: التحاليل والفحوصات الدورية"
    },
    {
      "type": "image_paragraph",
      "image": "https://i.ibb.co/PvkLFMR2/Screenshot-2025-11-19-215320.png",
      "paragraph": "التحاليل الدورية مثل تحاليل الدم والبول تساعد الطبيب على متابعة حالتك مبكراً والتعامل مع أي مشكلة قبل أن تتطور، لذلك من المهم الالتزام بجدول الفحوصات الموصى به."
    },

    {
      "type": "title",
      "value": "1. السكر التراكمي (HbA1c)"
    },
    {
      "type": "paragraph",
      "value": "هو فحص دم يقيس متوسط مستوى سكر الدم (الجلوكوز) خلال الشهرين إلى الثلاثة أشهر الماضية، حيث يرتبط سكر الدم ببروتين الهيموغلوبين في خلايا الدم الحمراء، وكلما ارتفع مستوى السكر في الدم زادت كمية الهيموغلوبين الجلوكوزي."
    },
    {
      "type": "paragraph",
      "value": "يُستخدم فحص السكر التراكمي لتشخيص مرض السكري أو مرحلة ما قبل السكري، وكذلك لمتابعة مدى نجاح خطة علاج مرض السكري على المدى الطويل."
    },
    {
      "type": "paragraph",
      "value": "عادة ما يوصي الطبيب بإجراء فحص السكر التراكمي من مرتين إلى أربع مرات سنوياً، أو حسب الحالة الصحية واستقرار مستوى السكر."
    },
    {
      "type": "paragraph",
      "value": "إذا كان مستوى السكر تحت السيطرة ومستقراً، قد يُجرى التحليل كل ستة أشهر، أما إذا كانت هناك تغييرات في خطة العلاج أو كان مستوى السكر غير مستقر فقد يُجرى كل ثلاثة أشهر."
    },
    {
      "type": "image_paragraph",
      "image": "https://i.ibb.co/kgZZYrCd/Screenshot-2025-11-19-215019.png",
      "paragraph": "يتم فحص السكر التراكمي في المختبر من خلال عينة دم، ويعطي صورة متكاملة عن مستوى السكر خلال الأشهر السابقة، وليس مجرد قراءة واحدة في لحظة معينة."
    },

    {
      "type": "title",
      "value": "2. سكر الدم الصائم (Fasting Blood Glucose)"
    },
    {
      "type": "paragraph",
      "value": "هو قياس مستوى السكر في الدم بعد صيام لا يقل عن ثماني ساعات، وغالباً ما يُجرى صباحاً بعد صيام طوال الليل."
    },
    {
      "type": "paragraph",
      "value": "يُستخدم هذا التحليل لتشخيص مرض السكري أو مرحلة ما قبل السكري، كما يساعد في متابعة استجابة الجسم للعلاج سواء كان عن طريق الأنسولين أو الأدوية الفموية."
    },
    {
      "type": "paragraph",
      "value": "لأغراض التشخيص قد يُجرى التحليل مرة واحدة أو مرتين للتأكيد، أما للمتابعة فيتم الاعتماد غالباً على قياسات جهاز السكر المنزلي بشكل يومي أو عدة مرات أسبوعياً، بالإضافة إلى الفحوصات المخبرية الدورية حسب توجيهات الطبيب."
    },
    {
      "type": "image_paragraph",
      "image": "https://i.ibb.co/7qBknkv/Screenshot-2025-11-19-215111.png",
      "paragraph": "تساعد قراءة جهاز قياس سكر الدم المنزلي على متابعة قيم السكر الصائم وقبل الوجبات وبعدها، مما يعطي صورة أوضح عن التحكم اليومي في المرض."
    },

    {
      "type": "title",
      "value": "3. فحص البول للزلال ووظائف الكلى"
    },
    {
      "type": "paragraph",
      "value": "يهدف فحص البول للكشف عن وجود كميات دقيقة من بروتين الألبومين في البول، وهو ما يسمى البيلة الألبومينية الدقيقة. في الحالة الطبيعية لا تقوم الكلى بتمرير الألبومين إلى البول، لذلك فإن وجود كمية كبيرة منه قد يشير إلى بداية تأثر الكلى بما يعرف باعتلال الكلية السكري."
    },
    {
      "type": "paragraph",
      "value": "من الفحوصات المرتبطة بوظائف الكلى أيضاً اختبار نسبة الألبومين إلى الكرياتينين في البول، حيث يقيس مقدار الألبومين مقارنة بالكرياتينين في عينة واحدة، مما يساعد على تقييم كفاءة عمل الكلى."
    },
    {
      "type": "paragraph",
      "value": "كما يتم قياس الكرياتينين في الدم وحساب معدل الترشيح الكبيبي المقدر (eGFR)، وهو مؤشر مهم على سرعة تصفية الكلى للفضلات من الدم، فكلما انخفضت هذه السرعة دل ذلك على تراجع في كفاءة الكلى."
    },
    {
      "type": "paragraph",
      "value": "يوصى لجميع مرضى السكري بإجراء فحص الألبومين في البول وحساب معدل الترشيح الكبيبي مرة واحدة سنوياً على الأقل، أو حسب ما يراه الطبيب مناسباً."
    },
    {
      "type": "image_paragraph",
      "image": "https://i.ibb.co/67MWnb7Y/Screenshot-2025-11-19-214937.png",
      "paragraph": "اختبارات البول باستخدام الشرائط التحليلية تساعد في الكشف المبكر عن وجود زلال أو مشكلات في الكلى قبل ظهور الأعراض."
    },
    {
      "type": "image_paragraph",
      "image": "https://i.ibb.co/chhN6T1Q/Screenshot-2025-11-19-214918.png",
      "paragraph": "متابعة وظائف الكلى بشكل دوري جزء أساسي من رعاية مريض السكري، لأن السكري غير المنضبط يُعد أحد أهم أسباب الفشل الكلوي المزمن."
    },

    {
      "type": "title",
      "value": "تحاليل إضافية مهمة لمرضى السكري"
    },
    {
      "type": "image_paragraph",
      "image": "https://i.ibb.co/bMdMdPJ7/Screenshot-2025-11-19-215005.png",
      "paragraph": "قد يطلب الطبيب تحاليل لوظائف الكبد عند الحاجة، لأن بعض أدوية السكري وحالات الدهون على الكبد قد تؤثر في عمله، والمتابعة المبكرة تساعد على تجنب المضاعفات."
    },
    {
      "type": "image_paragraph",
      "image": "https://i.ibb.co/1JqJcH7L/Screenshot-2025-11-19-214951.png",
      "paragraph": "تحليل الدهون والكوليسترول الكلي والضار من الفحوصات المهمة لمرضى السكري، لأن ارتفاعها يزيد من خطر أمراض القلب والشرايين، لذلك يُوصى بمتابعتها بانتظام."
    },
    {
      "type": "image_paragraph",
      "image": "https://i.ibb.co/Kp1Tk8L3/Screenshot-2025-11-19-215031.png",
      "paragraph": "أحياناً تُطلب تحاليل للفيتامينات والمعادن مثل الكالسيوم والحديد والمغنيسيوم، خاصة عند وجود أعراض نقص أو عند استعمال أدوية معينة، وذلك لضمان توازن العناصر الغذائية في الجسم."
    },

    {
      "type": "title",
      "value": "ثانياً: أنواع مرض السكري والفروقات بينها"
    },

    {
      "type": "title",
      "value": "1. السكري من النوع الأول"
    },
    {
      "type": "paragraph",
      "value": "السكري من النوع الأول هو مرض مناعي ذاتي يحدث عندما يهاجم جهاز المناعة في الجسم الخلايا المنتجة للأنسولين في البنكرياس، فيتوقف البنكرياس عن إنتاج الأنسولين أو ينتجه بكميات قليلة جداً."
    },
    {
      "type": "paragraph",
      "value": "غالباً ما يتم تشخيص هذا النوع في الأطفال والشباب، ويحتاج المريض إلى العلاج بالأنسولين الخارجي عن طريق الحقن أو المضخات مدى الحياة."
    },

    {
      "type": "title",
      "value": "2. السكري من النوع الثاني"
    },
    {
      "type": "paragraph",
      "value": "يُعد السكري من النوع الثاني الأكثر شيوعاً، ويحدث نتيجة مشكلتين رئيسيتين هما مقاومة الأنسولين ونقص إنتاجه مع مرور الوقت."
    },
    {
      "type": "paragraph",
      "value": "مقاومة الأنسولين تعني أن خلايا الجسم مثل العضلات والدهون والكبد لا تستجيب للأنسولين بشكل جيد، فلا تستطيع امتصاص سكر الدم بالكفاءة المطلوبة."
    },
    {
      "type": "paragraph",
      "value": "مع الوقت قد تقل قدرة البنكرياس على إنتاج الكمية الكافية من الأنسولين لمواجهة هذه المقاومة، فيرتفع مستوى السكر في الدم."
    },
    {
      "type": "paragraph",
      "value": "يرتبط هذا النوع بعوامل مثل السمنة، وقلة النشاط البدني، والوراثة، وغالباً ما يُشخّص عند البالغين، ويُعالج بتعديل نمط الحياة والأدوية الفموية، وقد يحتاج البعض إلى حقن الأنسولين لاحقاً."
    },

    {
      "type": "title",
      "value": "3. سكري الحمل"
    },
    {
      "type": "paragraph",
      "value": "يحدث سكري الحمل لأول مرة أثناء الحمل عندما ترتفع مستويات الجلوكوز في دم الأم، وغالباً ما يختفي بعد الولادة لكنه يزيد من خطر تطور السكري من النوع الثاني مستقبلاً لدى الأم."
    },
    {
      "type": "paragraph",
      "value": "قد يؤثر سكري الحمل في وزن الطفل ونموه داخل الرحم إذا لم تتم السيطرة عليه، لذلك يتطلب متابعة دقيقة وخطة علاجية واضحة تضمن سلامة الأم والجنين."
    },

    {
      "type": "title",
      "value": "ثالثاً: أجهزة قياس السكر والفروقات بينها"
    },

    {
      "type": "title",
      "value": "1. جهاز قياس سكر الدم التقليدي"
    },
    {
      "type": "paragraph",
      "value": "يتكون جهاز قياس سكر الدم التقليدي من الجهاز نفسه، وشرائط الاختبار، وقلم الوخز، وإبر الوخز. يتم وخز طرف الإصبع للحصول على قطرة دم توضع على الشريط لتظهر القراءة على الشاشة خلال ثوانٍ."
    },
    {
      "type": "paragraph",
      "value": "توجد أنواع تجارية مختلفة من هذه الأجهزة مثل بعض أجهزة Accu-Chek وOne Touch وContour وغيرها، ويختار الطبيب أو المريض النوع الأنسب حسب الدقة والتكلفة والتوفر."
    },
    {
      "type": "image_paragraph",
      "image": "https://i.ibb.co/k2GFbntv/Screenshot-2025-11-19-214849.png",
      "paragraph": "يوضح جهاز قياس السكر التقليدي طريقة قراءة قيمة سكر الدم من خلال قطرة صغيرة من الدم توضع على شريط الاختبار."
    },
    {
      "type": "image_paragraph",
      "image": "https://i.ibb.co/1fqnhDwn/Screenshot-2025-11-19-214900.png",
      "paragraph": "قياس السكر قبل الوجبات وبعدها يساعد على فهم تأثير الطعام والدواء والنشاط البدني على مستوى السكر في الدم، وهو جزء أساسي من المتابعة المنزلية."
    },

    {
      "type": "title",
      "value": "2. أجهزة القياس المستمر لسكر الدم (CGM)"
    },
    {
      "type": "paragraph",
      "value": "أجهزة القياس المستمر لسكر الدم تعمل دون الحاجة إلى وخز الإصبع المتكرر، حيث يتم تثبيت مستشعر صغير تحت الجلد، غالباً في الجزء الخلفي من الذراع، لقياس مستوى الجلوكوز في السائل الخلالي بشكل متواصل."
    },
    {
      "type": "paragraph",
      "value": "يمكن قراءة النتائج إما عن طريق تمرير جهاز قارئ أو هاتف ذكي على المستشعر على فترات متقطعة، أو من خلال إرسال القراءات بشكل مستمر إلى جهاز استقبال أو تطبيق على الهاتف."
    },
    {
      "type": "paragraph",
      "value": "تتميز هذه الأجهزة بأنها لا تعطي رقم السكر فقط، بل توضح أيضاً اتجاهات مستوى الجلوكوز صعوداً أو هبوطاً، ما يساعد المريض على اتخاذ قرارات وقائية قبل حدوث الهبوط أو الارتفاع الشديد."
    },
    {
      "type": "paragraph",
      "value": "يُعد جهاز فري ستايل ليبري مثالاً على أنظمة القياس المتقطع، حيث يتطلب تمرير القارئ أو الهاتف على المستشعر للحصول على القراءة."
    },

    {
      "type": "title",
      "value": "رابعاً: الفرق بين سرنجات وأقلام الأنسولين"
    },

    {
      "type": "title",
      "value": "1. سرنجات الأنسولين"
    },
    {
      "type": "paragraph",
      "value": "هي أدوات حقن تُستخدم لحقن الأنسولين تحت الجلد، وتختلف في السعة مثل 0.3 مل للجرعات الصغيرة، و0.5 مل للجرعات المتوسطة، و1 مل للجرعات الكبيرة."
    },
    {
      "type": "paragraph",
      "value": "تتوفر السرنجات بأطوال مختلفة للإبر مثل 4 أو 5 أو 6 أو 8 أو 12.7 مليمتر، وغالباً ما تُفضّل الإبر القصيرة لمعظم البالغين والأطفال لتقليل خطر حقن الأنسولين في العضل بدلاً من الطبقة الدهنية تحت الجلد."
    },
    {
      "type": "paragraph",
      "value": "كما يختلف قطر الإبرة ويُقاس بوحدة الجيج، فكلما زاد الرقم كانت الإبرة أرق مثل 29G أو 30G أو 31G، والإبر الأرق عادةً ما تكون أكثر راحة وأقل ألماً عند الحقن."
    },

    {
      "type": "title",
      "value": "2. قلم الأنسولين"
    },
    {
      "type": "paragraph",
      "value": "قلم الأنسولين هو جهاز يشبه القلم يُستخدم لحقن الأنسولين، ويتكون من جسم القلم وخرطوشة الأنسولين، إضافة إلى إبرة صغيرة قابلة للتغيير قبل كل حقنة."
    },
    {
      "type": "paragraph",
      "value": "يتم تحديد الجرعة عن طريق تدوير قرص أو مقياس على القلم، ثم يتم الحقن بسهولة تحت الجلد، ما يجعل استخدامه أكثر بساطة ودقة في الحياة اليومية."
    },
    {
      "type": "paragraph",
      "value": "تستخدم أقلام الأنسولين عادة إبر قصيرة ورفيعة مصممة خصيصاً لها، كما توجد أقلام قابلة لإعادة الاستخدام يتم فيها تغيير الخرطوشة فقط، وأقلام أخرى معبأة مسبقاً تُستخدم لفترة ثم يتم التخلص منها بعد نفاد الأنسولين."
    },

    {
      "type": "title",
      "value": "خامساً: العادات اليومية ونمط الحياة لمرضى السكري"
    },

    {
      "type": "image_paragraph",
      "image": "https://i.ibb.co/4ZGs8jGN/Screenshot-2025-11-19-215214.png",
      "paragraph": "العناية بالقدمين من أهم العادات لمرضى السكري، وتشمل غسل القدمين يومياً بالماء الفاتر وتجفيفهما جيداً خاصة بين الأصابع."
    },
    {
      "type": "image_paragraph",
      "image": "https://i.ibb.co/4RbmzjDP/Screenshot-2025-11-19-215150.png",
      "paragraph": "يفضل فحص القدمين يومياً بحثاً عن أي تشققات أو جروح صغيرة ومعالجتها مبكراً، مع ارتداء جوارب وأحذية مريحة لحماية القدم من الإصابات."
    },
    {
      "type": "image_paragraph",
      "image": "https://i.ibb.co/vCCY1NLZ/Screenshot-2025-11-19-215137.png",
      "paragraph": "شرب كميات كافية من الماء على مدار اليوم يساعد على ترطيب الجسم ودعم عمل الكلى، خاصة عند ارتفاع مستوى السكر في الدم."
    },
    {
      "type": "image_paragraph",
      "image": "https://i.ibb.co/dnxVRFt/Screenshot-2025-11-19-215125.png",
      "paragraph": "النشاط البدني المنتظم مثل المشي السريع أو الجري الخفيف في الهواء الطلق يساعد على تحسين حساسية الجسم للأنسولين وخفض مستوى السكر."
    },
    {
      "type": "image_paragraph",
      "image": "https://i.ibb.co/MkMKg16c/Screenshot-2025-11-19-215049.png",
      "paragraph": "تنظيم مواعيد الوجبات وعدم إهمال وجبة الإفطار يساعد على ثبات مستوى السكر في الدم وتقليل نوبات الهبوط أو الارتفاع المفاجئ."
    },
    {
      "type": "image_paragraph",
      "image": "https://i.ibb.co/hFJcT1Bz/Screenshot-2025-11-19-215253.png",
      "paragraph": "الاعتماد على طبق متوازن يحتوي على خضروات وألياف ونشويات معقدة وبروتينات صحية ودهون مفيدة يدعم التحكم الجيد في السكر والوزن."
    },
    {
      "type": "image_paragraph",
      "image": "https://i.ibb.co/6RwvrCpV/Screenshot-2025-11-19-215305.png",
      "paragraph": "إدارة التوتر من خلال التأمل أو تمارين التنفس أو الهوايات المريحة قد تساهم في استقرار مستوى السكر لأن التوتر المزمن يرفع هرمونات ترفع سكر الدم."
    },
    {
      "type": "image_paragraph",
      "image": "https://i.ibb.co/B5LwGXBF/Screenshot-2025-11-19-215223.png",
      "paragraph": "الإقلاع عن التدخين خطوة أساسية لمرضى السكري، لأنه يزيد من خطر أمراض القلب والأوعية الدموية ومشكلات الدورة الدموية في الأطراف."
    }
  ]
}
