{
  "educational": [
    {
      "title": "استمتع بالعيد من غير ما السكر يعلى",
      "summary": "في العيد، حاول توازن بين إنك تستمتع بالكحك والبسكويت وبين إنك ما تفرطش فيهم عشان ما يحصلش ارتفاع مفاجئ في السكر. خُد قطعة صغيرة من الكحك مع أكل متوازن زي فاكهة أو زبادي، وتمشى شوية بعد الأكل عشان الهضم، واشرب ميه كتير تعوض السوائل اللي جسمك فقدها، واستمتع بالعيد مع أهلك وحبايبك.",
      "images": [
        "https://images.pexels.com/photos/5865658/pexels-photo-5865658.jpeg",
        "https://images.pexels.com/photos/416528/pexels-photo-416528.jpeg",
        "https://images.pexels.com/photos/19682337/pexels-photo-19682337.jpeg"
      ]
    },
    {
      "title": "اختيارات فطار صحي",
      "summary": "ابدأ يومك بفطار قليل في السكريات المضافة والكربوهيدرات المكررة، وغني بالألياف والبروتين والدهون الصحية. اختيارات زي الأومليت بالخضار، الزبادي اليوناني مع توت ومكسرات، ساندويتش بيض بالأفوكادو، أو شوفان خشن هيدّوك طاقة ثابتة ويساعدوا في توازن السكر في الدم. خلي فطارك يحتوي على ألياف وبروتين ودهون مفيدة، وقلل الأكل اللي فيه كربوهيدرات معالجة زي الكورن فليكس الأبيض والعيش الأبيض والحلويات اللي بترفع السكر بسرعة.",
      "images": [
        "https://images.pexels.com/photos/16119655/pexels-photo-16119655.jpeg",
        "https://images.pexels.com/photos/27850094/pexels-photo-27850094.jpeg",
        "https://images.pexels.com/photos/27850095/pexels-photo-27850095.jpeg"
      ]
    },
    {
      "title": "فهم الكربوهيدرات ومستوى السكر",
      "summary": "الكربوهيدرات بتتحول لسكر أثناء الهضم؛ الكربوهيدرات البسيطة زي الجلوكوز والفركتوز بتتهضم بسرعة وبتسبب ارتفاع مفاجئ في السكر، أما الكربوهيدرات المعقدة اللي فيها ألياف بتتهضم ببطء وبتخلي الارتفاع تدريجي. المؤشر الجلايسيمي بيقس سرعة ارتفاع السكر بعد الأكل – الأكل اللي مؤشره منخفض زي الشوفان الكامل بيرفع السكر ببطء، أما الأكل العالي زي العيش الأبيض والبطاطس بيرفعه بسرعة. لما تختار أكل غني بالألياف ومنخفض في المؤشر الجلايسيمي، بتساعد في تنظيم السكر وتقليل خطر السكر النوع التاني وأمراض القلب.",
      "images": [
        "https://upload.wikimedia.org/wikipedia/commons/7/79/Vegan_Nine_Grain_Whole_Wheat_Bread.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/4/4d/Suckale08_fig3_glucose_insulin_day.png",
        "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ca/Brown_rice_cooked.JPG/1280px-Brown_rice_cooked.JPG"
      ]
    }
  ],
  "habits": [
    {
      "id": "drink_water",
      "name": "اشرب ميه",
      "image": "https://images.pexels.com/photos/416528/pexels-photo-416528.jpeg",
      "repetitionHours": 2,
      "description": "حاول تشرب من 9 لـ 13 كوباية ميه في اليوم إلا لو دكتورك قال غير كده. الترطيب الكويس بيساعد على تنظيم السكر ويدعم وظيفة الكلى، والجفاف ممكن يخلي مستوى السكر يعلى."
    },
    {
      "id": "check_blood_sugar",
      "name": "تابع مستوى السكر",
      "image": "https://upload.wikimedia.org/wikipedia/commons/4/44/Glucometer01.JPG",
      "repetitionHours": 4,
      "description": "افحص مستوى السكر بانتظام. الناس اللي عندها سكر من النوع الأول بتقيس من 4 لـ 10 مرات في اليوم – قبل الأكل والوجبات الخفيفة، قبل وبعد التمرين، وقبل النوم. اللي بياخدوا إنسولين من النوع التاني بيقيسوا غالبًا قبل الأكل وقبل النوم."
    },
    {
      "id": "eat_regular_meals",
      "name": "كُل في مواعيد منتظمة",
      "image": "https://images.pexels.com/photos/1640777/pexels-photo-1640777.jpeg",
      "repetitionHours": 0.03,
      "description": "كُل في أوقات ثابتة وسيب من ساعتين لتلاتة بين الوجبات عشان مستوى السكر يرجع طبيعي قبل ما تاكل تاني. لو جوعت بين الوجبات، اختار سناكس فيها بروتين ودهون مفيدة وألياف زي فاكهة مع مكسرات أو خضار مع حمص."
    },
    {
      "id": "exercise",
      "name": "اتحرّك",
      "image": "https://images.pexels.com/photos/19682337/pexels-photo-19682337.jpeg",
      "repetitionHours": 24,
      "description": "مارس رياضة على الأقل 150 دقيقة في الأسبوع – يعني حوالي نص ساعة 5 أيام في الأسبوع، وما تسيبش يومين ورا بعض من غير حركة. النشاط البدني المنتظم بيحسّن حساسية الجسم للإنسولين وبيساعده يستخدم الجلوكوز كطاقة، فحاول تتحرك كل يوم حتى لو بالمشي أو اليوجا أو تمارين المقاومة."
    },
    {
      "id": "sleep",
      "name": "نام كويس",
      "image": "https://images.pexels.com/photos/545016/pexels-photo-545016.jpeg",
      "repetitionHours": 24,
      "description": "حاول تنام على الأقل 7 ساعات كل ليلة. قلة النوم بتزود مقاومة الإنسولين وبتصعّب التحكم في السكر. خليك ثابت في مواعيد النوم والصحيان، قلل استخدام الموبايل قبل النوم، واعمل جو هادي يساعدك تنام كويس."
    }
  ]
}
