{
  "educational": [
    {
      "title": "لماذا يجب فحص مستوى الجلوكوز كثيرًا؟",
      "summary": "الفحوص المتكررة لمستوى الجلوكوز باستخدام جهاز القياس أو جهاز المراقبة المستمرة للجلوكوز تمكّن من اكتشاف ارتفاعات وانخفاضات السكر مبكرًا، وتساعد في ضبط جرعات الأدوية بأمان، وتكشف عن الأنماط حتى يتمكن فريق الرعاية من تعديل الخطة. المراقبة المنتظمة تقلل من معدل HbA1c وتخفف من المضاعفات على المدى الطويل. باستخدام جهاز المراقبة المستمرة، فإن استهداف قضاء وقت أطول بين ‎70–180‎ ملغ/د.ل (الوقت ضمن النطاق) يمنح طاقة أكثر استقرارًا ومفاجآت أقل.",
      "images": [
        "https://upload.wikimedia.org/wikipedia/commons/4/44/Glucometer01.JPG"
      ]
    },
    {
      "title": "لماذا يجب إجراء فحوص عيون منتظمة؟",
      "summary": "قد يبدأ اعتلال الشبكية السكري بدون أعراض ومع ذلك يهدد الرؤية. الفحص الموسع للأوعية الدموية يكتشف تسرب الأوعية الصغيرة، التورم أو نمو أوعية جديدة في وقت مبكر عندما يكون العلاج أكثر فعالية. بالنسبة لمرضى النوع الثاني، يجب إجراء الفحص عند التشخيص؛ وبالنسبة للنوع الأول في خلال خمس سنوات من بداية المرض. إذا لم يظهر اعتلال شبكية، يمكن لطبيب العيون ترك مسافة بين الزيارات سنة إلى سنتين، وإذا وُجد المرض أو أثناء الحمل ستكون المتابعة أكثر تكرارًا.",
      "images": [
        "https://images.pexels.com/photos/5752266/pexels-photo-5752266.jpeg"
      ]
    },
    {
      "title": "لماذا يجب فحص القدمين يوميًا؟",
      "summary": "يمكن أن يؤدي تلف الأعصاب (الاعتلال العصبي) إلى فقدان الشعور بالألم، وبالتالي تتحول الجروح الصغيرة إلى إصابات كبيرة دون ملاحظتها. الفحوص الذاتية اليومية إلى جانب الفحوص المهنية السنوية تلتقط الاحمرار، البثور، مناطق الضغط أو التغير في شكل القدم مبكرًا، وتمنع التقرحات والبتر. إذا كنت معرضًا للخطر، اطلب فحصًا سريعًا للقدم في كل زيارة للعيادة.",
      "images": [
          "https://footsmartpodiatry.co.uk/wp-content/uploads/2018/03/diabetic-foot-checks-pulses-sensation-foot-deformity-callus-footsmart-podiatry-300x264.png"
      ]
    },
    {
      "title": "لماذا يجب فحص وظيفة الكلى بانتظام؟",
      "summary": "يبدأ تلف الكلى غالبًا بصمت. اختبارات سنوية مثل نسبة الألبومين إلى الكرياتينين في البول (UACR) ومعدل الترشيح الكبيبي التقديري (eGFR) تكشف عن المشكلات مبكرًا عندما يمكن تصحيحها. إذا ارتفعت نسبة الألبومين أو انخفض eGFR، يمكن للعلاج إبطاء التدهور أو إيقافه وحماية القلب أيضًا؛ وتصبح المتابعة أكثر تكرارًا عند وجود مرض الكلى المزمن.",
      "images": [
        "https://www.diaverum.sa/globalassets/kidney-care/chronic-kidney-disease/stages-of-ckd/kidney.jpg"  
            ]
    }
  ],
  "habits": [
    {
      "id": "check_blood_glucose_often",
      "name": "افحص مستوى الجلوكوز وفق الجدول",
      "image": "https://upload.wikimedia.org/wikipedia/commons/4/44/Glucometer01.JPG",
      "repetitionHours": 4,
      "description": "استخدم جهاز القياس أو جهاز المراقبة المستمرة للجلوكوز كما نصحك فريق الرعاية. نقاط الفحص المعتادة تشمل: قبل الوجبات والنوم، قبل وبعد التمرين، أثناء المرض، وعندما تشعر بانخفاض أو ارتفاع في السكر. دوّن الاتجاهات لتعديل الأدوية بأمان."
    },
    {
      "id": "eye_exam_yearly",
      "name": "فحص العين بالتوسيع",
      "image": "https://images.pexels.com/photos/5752266/pexels-photo-5752266.jpeg",
      "repetitionHours": 8760,
      "description": "احجز فحصًا شاملاً بتوسيع بؤبؤ العين مرة واحدة على الأقل كل عام (للمصابين بالنوع الثاني عند التشخيص، وللنمط الأول خلال خمس سنوات من البداية). إذا كان هناك اعتلال شبكية أو أثناء الحمل، اتبع جدول طبيب العيون الأكثر تكرارًا."
    },
    {
      "id": "daily_foot_check",
      "name": "فحص القدم يوميًا",
      "image": "https://upload.wikimedia.org/wikipedia/commons/8/89/US_Navy_100811-N-8361C-002_Dr._Dawn_Bell_explains_the_importance_of_proper_foot_care_to_a_group_of_diabetic_children.jpg",
      "repetitionHours": 24,
      "description": "افحص أعلى القدمين وأسفلها وبين الأصابع للتأكد من عدم وجود جروح أو بثور أو احمرار أو تورم أو مشاكل في الأظافر. استخدم مرطبًا للجلد الجاف، ولا تمشِ حافي القدمين، واحصل على فحص مهني للقدم مرة واحدة في السنة أو أكثر إذا كنت معرضًا للخطر."
    },
    {
      "id": "kidney_labs",
      "name": "تحاليل الكلى (UACR + eGFR)",
      "image": "https://www.diaverum.sa/globalassets/kidney-care/chronic-kidney-disease/stages-of-ckd/kidney.jpg",
      "repetitionHours": 0.001,
      "description": "أجرِ فحص نسبة الألبومين إلى الكرياتينين في البول وفحص الكرياتينين في الدم/ eGFR مرة واحدة على الأقل سنويًا؛ زد تكرار الاختبارات إذا ظهرت الألبومينية أو انخفاض eGFR حسب خطة الطبيب."
    }
  ]
}
